app/Controllers/Users.php

    public function create()
    {
        $data = $this->request->getPost();
        $validate = $this->validation->run($data, 'register');
        $errors = $this->validation->getErrors();
        if ($errors) {
        return $this->fail($errors);
    }

    $user = new \App\Entities\Users();
    $user->fill($data);
    $user->created_by = 0;
    $user->created_date = date("Y-m-d H:i:s");
    if ($this->model->save($user)) {
---
INSERT INTO `users` (`username`, `salt`, `password`, `firstname`, `lastname`, `address`, `age`, `created_by`, `created_date`) VALUES ('Bibit Raikhan Azzakiii', '66589757314306.20761630', '76619adc6f525d1e4eb5b5303fa0eec1', 'Bibit', 'Azzaki', 'Karangkobar,Banjarnegara', '19', 0, '2024-05-30 15:12:23')

    public function update($id = null)
    {
        $data = $this->request->getRawInput();
        $data['id'] = $id;
        $validate = $this->validation->run($data, 'update_user');
        $errors = $this->validation->getErrors();

        if ($errors) {
            return $this->fail($errors);
        }

        if (!$this->model->findById($id)) {
            return $this->fail('id tidak ditemukan');
        }

        $user = new \App\Entities\Users();
        $user->fill($data);
        $user->updated_by = 0;
        $user->updated_date = date("Y-m-d H:i:s");
        if ($this->model->save($user)) {
---
UPDATE `users` SET `username` = 'Bibit Raikhan Azzaki Edit', `salt` = '665897e3ec1f32.18646298', `password` = 'f01b7ffa35a5d3035b604e218897999d', `firstname` = 'Bibit Edit', `lastname` = 'Azzaki Edit', `address` = 'Karangkobar,Banjarnegara Edit', `age` = '12', `updated_by` = 0, `updated_date` = '2024-05-30 15:14:43'
WHERE `users`.`id` IN ('1')